In [4]:
%pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in /home/sohiab/.local/lib/python3.10/site-packages (9.1.0)

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

from mysql.connector import Error
import pandas as pd
from dotenv import load_dotenv
import os

load_dotenv()

True

In [3]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try: 
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print("MySQL Database Connection Successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# MySQL Terminal Password
pw = os.getenv("DB_PASSWORD")
# Database Name
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySQL Database Connection Successful

In [4]:
# Create mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try: 
        cursor.execute(query)
        print("Database Create Successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "create database mysql_python"
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [5]:
# Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name, 
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySQL database connection successfull")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [6]:
# Execute sql queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

In [7]:
create_orders_table = """
create table orders(order_id int primary key, customer_name varchar(30) not null, product_name varchar(20) not null, date_ordered date, quantity int, unit_price float, phone_number varchar(20));
"""

# Connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Error: '1050 (42S01): Table 'orders' already exists'

In [9]:
# Insert Data

data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-09-12', 1, 800, '6293730802'),
(102, 'John', 'T-Shirt', '2019-06-22', 2, 200, '6293730803'),
(103, 'An', 'Smart TV', '2023-10-15', 1, 400, '6293730705'),
(104, 'So', 'Book', '2024-11-18', 4, 150, '6293730602'),
(105, 'Ni', 'Laptop', '2020-07-01', 2, 1200, '6293730755'),
(106, 'Ahm', 'Monitor', '2019-08-12', 3, 450, '6293730966');
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Query was successful

In [10]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [11]:
# Using the select stmt
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 9, 12), 1, 800.0, '6293730802')
(102, 'John', 'T-Shirt', datetime.date(2019, 6, 22), 2, 200.0, '6293730803')
(103, 'An', 'Smart TV', datetime.date(2023, 10, 15), 1, 400.0, '6293730705')
(104, 'So', 'Book', datetime.date(2024, 11, 18), 4, 150.0, '6293730602')
(105, 'Ni', 'Laptop', datetime.date(2020, 7, 1), 2, 1200.0, '6293730755')
(106, 'Ahm', 'Monitor', datetime.date(2019, 8, 12), 3, 450.0, '6293730966')

In [13]:
q2 = """
select customer_name, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '6293730802')
('John', '6293730803')
('An', '6293730705')
('So', '6293730602')
('Ni', '6293730755')
('Ahm', '6293730966')

In [14]:
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2023,)
(2024,)
(2020,)
(2019,)

In [15]:
q4 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2023,)
(2024,)
(2020,)

In [16]:
q5 = """
select * from orders where date_ordered < '2020-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 9, 12), 1, 800.0, '6293730802')
(102, 'John', 'T-Shirt', datetime.date(2019, 6, 22), 2, 200.0, '6293730803')
(105, 'Ni', 'Laptop', datetime.date(2020, 7, 1), 2, 1200.0, '6293730755')
(106, 'Ahm', 'Monitor', datetime.date(2019, 8, 12), 3, 450.0, '6293730966')

In [18]:
q6 = """
select * from orders where date_ordered > '2020-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'An', 'Smart TV', datetime.date(2023, 10, 15), 1, 400.0, '6293730705')
(104, 'So', 'Book', datetime.date(2024, 11, 18), 4, 150.0, '6293730602')

In [20]:
q7 = """
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successfull
(105, 'Ni', 'Laptop', datetime.date(2020, 7, 1), 2, 1200.0, '6293730755')
(101, 'Steve', 'Laptop', datetime.date(2018, 9, 12), 1, 800.0, '6293730802')
(106, 'Ahm', 'Monitor', datetime.date(2019, 8, 12), 3, 450.0, '6293730966')
(103, 'An', 'Smart TV', datetime.date(2023, 10, 15), 1, 400.0, '6293730705')
(102, 'John', 'T-Shirt', datetime.date(2019, 6, 22), 2, 200.0, '6293730803')
(104, 'So', 'Book', datetime.date(2024, 11, 18), 4, 150.0, '6293730602')

In [21]:
# Data Frame
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"]

df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,105,Ni,Laptop,2020-07-01,2,1200.0,6293730755
1,101,Steve,Laptop,2018-09-12,1,800.0,6293730802
2,106,Ahm,Monitor,2019-08-12,3,450.0,6293730966
3,103,An,Smart TV,2023-10-15,1,400.0,6293730705
4,102,John,T-Shirt,2019-06-22,2,200.0,6293730803
5,104,So,Book,2024-11-18,4,150.0,6293730602

In [22]:
# Update Command

update = """
update orders
set unit_price = 250
where order_id = 102;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was successful

In [23]:
# Check the Update
q8 = """
select * from orders where order_id = 102;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successfull
(102, 'John', 'T-Shirt', datetime.date(2019, 6, 22), 2, 250.0, '6293730803')

In [25]:
# Delete Command

delete_order = """
delete from orders
where order_id = 101;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL database connection successfull
Query was successful

In [26]:
# Check the Delete
q9 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successfull
(102, 'John', 'T-Shirt', datetime.date(2019, 6, 22), 2, 250.0, '6293730803')
(103, 'An', 'Smart TV', datetime.date(2023, 10, 15), 1, 400.0, '6293730705')
(104, 'So', 'Book', datetime.date(2024, 11, 18), 4, 150.0, '6293730602')
(105, 'Ni', 'Laptop', datetime.date(2020, 7, 1), 2, 1200.0, '6293730755')
(106, 'Ahm', 'Monitor', datetime.date(2019, 8, 12), 3, 450.0, '6293730966')